# DocumentSet Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentSet Class
Members See Also
---
A set that can contain any documents.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class DocumentSet : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class DocumentSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class DocumentSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..DocumentSet
# See Also
DocumentSet Members
Autodesk.Revit.DB Namespace